[Survived] StringLiteral
main/components/Commons/AdminCommonsCard.jsx:243:28
               variant="info"
               size="sm"
               // href={`/admin/chat/${commons.id}`}
-              data-testid={`AdminCommonsCard-Chat-${commons.id}`}
+              data-testid={``}
               onClick={() => navigate(`/admin/chat/${commons.id}`)}
             >

[Survived] ArrowFunction
main/components/Commons/AdminCommonsCard.jsx:244:24
               size="sm"
               // href={`/admin/chat/${commons.id}`}
               data-testid={`AdminCommonsCard-Chat-${commons.id}`}
-              onClick={() => navigate(`/admin/chat/${commons.id}`)}
+              onClick={() => undefined}
             >
               Chat

[NoCoverage] StringLiteral
main/components/Commons/AdminCommonsCard.jsx:244:39
               size="sm"
               // href={`/admin/chat/${commons.id}`}
               data-testid={`AdminCommonsCard-Chat-${commons.id}`}
-              onClick={() => navigate(`/admin/chat/${commons.id}`)}
+              onClick={() => navigate(``)}
             >
               Chat
