[Survived] ConditionalExpression
src/main/pages/ChatHistoryPage.jsx:118:35
         </Button>
         <div className="d-flex justify-content-between align-items-center mb-3">
           <h2 className="mb-0">
-            Commons #{commonsId} {readOnly && "• Admin Read Only"}
+            Commons #{commonsId} {true}
           </h2>
           <span className="text-muted">Commons #{commonsId}</span>

[Survived] LogicalOperator
src/main/pages/ChatHistoryPage.jsx:118:35
         </Button>
         <div className="d-flex justify-content-between align-items-center mb-3">
           <h2 className="mb-0">
-            Commons #{commonsId} {readOnly && "• Admin Read Only"}
+            Commons #{commonsId} {readOnly || "• Admin Read Only"}
           </h2>
           <span className="text-muted">Commons #{commonsId}</span>

[Survived] ConditionalExpression
src/main/pages/ChatHistoryPage.jsx:122:10
           </h2>
           <span className="text-muted">Commons #{commonsId}</span>
         </div>
-        {!readOnly && (
-          <div className="mb-4">
-            <ChatMessageCreate commonsId={commonsId} />
-          </div>
-        )}
+        {false}
         <div
           style={{

[Survived] ConditionalExpression
src/main/pages/ChatHistoryPage.jsx:122:10
           </h2>
           <span className="text-muted">Commons #{commonsId}</span>
         </div>
-        {!readOnly && (
-          <div className="mb-4">
-            <ChatMessageCreate commonsId={commonsId} />
-          </div>
-        )}
+        {true}
         <div
           style={{

[Killed] ConditionalExpression
src/main/pages/ChatHistoryPage.jsx:150:12
               Unable to load chat messages.
             </div>
           )}
-          {!isInitialLoading && messages.length === 0 && (
-            <div className="text-center text-muted my-3">
-              No messages available for this commons.
-            </div>
-          )}
+          {true}
           {messages.map((message) => (
             <ChatMessageDisplay key={message.id} message={message} />
killedBy: ChatHistoryPage shows empty state when there are no messages after loading
statusReason: Unable to find an element with the text: /No messages available for this commons/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
src/main/pages/ChatHistoryPage.jsx:150:12
               Unable to load chat messages.
             </div>
           )}
-          {!isInitialLoading && messages.length === 0 && (
+          {true && (
             <div className="text-center text-muted my-3">
               No messages available for this commons.
killedBy: ChatHistoryPage renders chat messages and shows terminal status when no more pages
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="text-center text-muted my-3"
>
  No messages available for this commons.
</div> instead
