[Killed] ArrowFunction
src/main/pages/AdminJobsPage.jsx:95:51
     }
   };
   // *** RecordCommonStats job ***
-  const objectToAxiosParamsRecordCommonStatsJob = () => ({
-    url: "/api/jobs/launch/recordcommonstats",
-    method: "POST",
-  });
+  const objectToAxiosParamsRecordCommonStatsJob = () => undefined;
 
   // Stryker disable all
killedBy: AdminJobsPage tests user can submit record common stats job
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
src/main/pages/AdminJobsPage.jsx:145:9
       MilkTheCowsMutation.mutate();
     } else {
       toast(
-        `Submitted Job: Milk The Cows! (Commons: ${data.selectedCommonsName})`,
+        ``,
       );
       MilkTheCowsSingleMutation.mutate(data);
killedBy: AdminJobsPage tests user can submit milk the cows job
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "Submitted Job: Milk The Cows! (Commons: Anika's Commons)",
