[Killed] BlockStatement
src/main/pages/AdminChatPage.jsx:4:29
 import React from "react";
 import ChatHistoryPage from "main/pages/ChatHistoryPage"; // adjust path if needed
 
-const AdminChatPage = () => {
-  return <ChatHistoryPage readOnly={true} />;
-};
+const AdminChatPage = () => {};
 
 export default AdminChatPage;
killedBy: AdminChatPage tests (coverage + Stryker) exports a component and renders
statusReason: Unable to find an element by: [data-testid="ChatHistoryPageMock"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] BooleanLiteral
src/main/pages/AdminChatPage.jsx:5:37
 import ChatHistoryPage from "main/pages/ChatHistoryPage"; // adjust path if needed
 
 const AdminChatPage = () => {
-  return <ChatHistoryPage readOnly={true} />;
+  return <ChatHistoryPage readOnly={false} />;
 };
 
killedBy: AdminChatPage tests (coverage + Stryker) passes readOnly=true exactly (kills boolean literal + removed prop mutants)
statusReason: expected false to be true // Object.is equality
