[Killed] BooleanLiteral
src/main/pages/ChatHistoryPage.jsx:15:39
 const PAGE_SIZE = 25;
 const REFRESH_RATE = 2000;
 
-const ChatHistoryPage = ({ readOnly = false }) => {
+const ChatHistoryPage = ({ readOnly = true }) => {
   const { commonsId } = useParams();
   const navigate = useNavigate();
killedBy: ChatHistoryPage renders create form when not readOnly (default)
statusReason: Unable to find an element by: [data-testid="ChatMessageCreate"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
src/main/pages/ChatHistoryPage.jsx:118:35
         </Button>
         <div className="d-flex justify-content-between align-items-center mb-3">
           <span className="text-muted">
-            Commons #{commonsId} {readOnly && "• Admin Read Only"}
+            Commons #{commonsId} {readOnly || "• Admin Read Only"}
           </span>
           <span className="text-muted">Commons #{commonsId}</span>
killedBy: ChatHistoryPage renders create form when not readOnly (default)
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <span
  class="text-muted"
>
  Commons #
  1

[Killed] ConditionalExpression
src/main/pages/ChatHistoryPage.jsx:123:10
           <span className="text-muted">Commons #{commonsId}</span>
         </div>
 
-        {!readOnly && (
-          <div className="mb-4">
-            <ChatMessageCreate commonsId={commonsId} />
-          </div>
-        )}
+        {false}
 
         <div
killedBy: ChatHistoryPage renders create form when not readOnly (default)
statusReason: Unable to find an element by: [data-testid="ChatMessageCreate"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] EqualityOperator
src/main/pages/ChatHistoryPage.jsx:152:33
               Unable to load chat messages.
             </div>
           )}
-          {!isInitialLoading && messages.length === 0 && (
+          {!isInitialLoading && messages.length !== 0 && (
             <div className="text-center text-muted my-3">
               No messages available for this commons.
killedBy: ChatHistoryPage renders chat messages and shows terminal status when no more pages
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="text-center text-muted my-3"
>
  No messages available for this commons.
</div> instead
