[Killed] BooleanLiteral
src/main/pages/ChatHistoryPage.jsx:16:56
 const PAGE_SIZE = 25;
 const REFRESH_RATE = 2000;
 
-const ChatHistoryPage = ({ readOnly = false, isAdmin = false }) => {
+const ChatHistoryPage = ({ readOnly = false, isAdmin = true }) => {
   const { commonsId } = useParams();
   const navigate = useNavigate();
killedBy: ChatHistoryPage renders chat messages and shows terminal status when no more pages
statusReason: Unable to find an element by: [data-testid="ChatMessageDisplay-1"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BooleanLiteral
src/main/pages/ChatHistoryPage.jsx:16:39
 const PAGE_SIZE = 25;
 const REFRESH_RATE = 2000;
 
-const ChatHistoryPage = ({ readOnly = false, isAdmin = false }) => {
+const ChatHistoryPage = ({ readOnly = true, isAdmin = false }) => {
   const { commonsId } = useParams();
   const navigate = useNavigate();
killedBy: ChatHistoryPage renders create form when not readOnly (default)
statusReason: Unable to find an element by: [data-testid="ChatMessageCreate"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrayDeclaration
src/main/pages/ChatHistoryPage.jsx:22:5
   const loadMoreRef = useRef(null);
 
   const { data: userCommonsList } = useBackend(
-    [`/api/usercommons/commons/all?commonsId=${commonsId}`],
+    [],
     {
       method: "GET",
killedBy: ChatHistoryPage configures user commons query with expected polling options
statusReason: expected "useBackend" to be called with arguments: [ …(4) ]

Received: 

  1st useBackend call:

@@ -1,9 +1,7 @@
  [

[Survived] ArrowFunction
src/main/pages/ChatHistoryPage.jsx:43:5
     : {};
 
   const deleteMutation = useBackendMutation(
-    (id) => ({
-      url: "/api/chat/hide",
-      method: "PUT",
-      params: { chatMessageId: id },
-    }),
+    () => undefined,
     {
       onSuccess: () => {

[NoCoverage] StringLiteral
src/main/pages/ChatHistoryPage.jsx:44:12
 
   const deleteMutation = useBackendMutation(
     (id) => ({
-      url: "/api/chat/hide",
+      url: "",
       method: "PUT",
       params: { chatMessageId: id },

[Survived] ArrayDeclaration
src/main/pages/ChatHistoryPage.jsx:53:5
         // React Query will refetch automatically if keys match
       },
     },
-    [`/api/chat/admin/get?commonsId=${commonsId}`], // IMPORTANT
+    [], // IMPORTANT
   );
 

[Survived] StringLiteral
src/main/pages/ChatHistoryPage.jsx:53:6
         // React Query will refetch automatically if keys match
       },
     },
-    [`/api/chat/admin/get?commonsId=${commonsId}`], // IMPORTANT
+    [``], // IMPORTANT
   );
 

[NoCoverage] BlockStatement
src/main/pages/ChatHistoryPage.jsx:56:32
     [`/api/chat/admin/get?commonsId=${commonsId}`], // IMPORTANT
   );
 
-  const handleDelete = (id) => {
-    if (window.confirm("Delete this message?")) {
-      deleteMutation.mutate(id);
-    }
-  };
+  const handleDelete = (id) => {};
 
   const fetchChatPage = async ({ pageParam = 0 }) => {

[NoCoverage] ConditionalExpression
src/main/pages/ChatHistoryPage.jsx:57:9
   );
 
   const handleDelete = (id) => {
-    if (window.confirm("Delete this message?")) {
+    if (false) {
       deleteMutation.mutate(id);
     }

[NoCoverage] BlockStatement
src/main/pages/ChatHistoryPage.jsx:57:49
   );
 
   const handleDelete = (id) => {
-    if (window.confirm("Delete this message?")) {
-      deleteMutation.mutate(id);
-    }
+    if (window.confirm("Delete this message?")) {}
   };
 

[Killed] BlockStatement
src/main/pages/ChatHistoryPage.jsx:62:54
     }
   };
 
-  const fetchChatPage = async ({ pageParam = 0 }) => {
-    const response = await axios.get(
-      isAdmin ? "/api/chat/admin/get" : "/api/chat/get",
-      {
-        params: {
-          commonsId,
-          page: pageParam,
-          size: PAGE_SIZE,
-        },
-      },
-    );
-    return response.data;
-  };
+  const fetchChatPage = async ({ pageParam = 0 }) => {};
 
   const {
killedBy: ChatHistoryPage renders chat messages and shows terminal status when no more pages
statusReason: Unable to find an element by: [data-testid="ChatMessageDisplay-1"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[NoCoverage] StringLiteral
src/main/pages/ChatHistoryPage.jsx:64:17
 
   const fetchChatPage = async ({ pageParam = 0 }) => {
     const response = await axios.get(
-      isAdmin ? "/api/chat/admin/get" : "/api/chat/get",
+      isAdmin ? "" : "/api/chat/get",
       {
         params: {

[Killed] ObjectLiteral
src/main/pages/ChatHistoryPage.jsx:83:67
     hasNextPage,
     isFetching,
     isFetchingNextPage,
-  } = useInfiniteQuery(["chatHistory", commonsId], fetchChatPage, {
-    getNextPageParam: (lastPage, pages) =>
-      lastPage?.last === false ? pages.length : undefined,
-    refetchInterval: REFRESH_RATE,
-    enabled: !!commonsId,
-  });
+  } = useInfiniteQuery(["chatHistory", commonsId], fetchChatPage, {});
 
   useEffect(() => {
killedBy: ChatHistoryPage configures chat history query with commons id and pagination logic
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/main/pages/ChatHistoryPage.jsx:85:7
     isFetchingNextPage,
   } = useInfiniteQuery(["chatHistory", commonsId], fetchChatPage, {
     getNextPageParam: (lastPage, pages) =>
-      lastPage?.last === false ? pages.length : undefined,
+      false ? pages.length : undefined,
     refetchInterval: REFRESH_RATE,
     enabled: !!commonsId,
killedBy: ChatHistoryPage configures chat history query with commons id and pagination logic
statusReason: expected undefined to be 2 // Object.is equality

[Killed] BooleanLiteral
src/main/pages/ChatHistoryPage.jsx:91:9
   });
 
   useEffect(() => {
-    if (!hasNextPage) {
+    if (hasNextPage) {
       return;
     }
killedBy: ChatHistoryPage does not register an observer when there are no additional pages
statusReason: expected "spy" to not be called at all, but actually been called 1 times

Received: 

  1st spy call:

    Array [
      [Function anonymous],

[Killed] BlockStatement
src/main/pages/ChatHistoryPage.jsx:97:78
 
     const observer = new IntersectionObserver(
       (entries) => {
-        if (entries[0].isIntersecting && hasNextPage && !isFetchingNextPage) {
-          fetchNextPage();
-        }
+        if (entries[0].isIntersecting && hasNextPage && !isFetchingNextPage) {}
       },
       {
killedBy: ChatHistoryPage wires up intersection observer to load additional pages
statusReason: expected 0 to be greater than 0

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BooleanLiteral
src/main/pages/ChatHistoryPage.jsx:116:13
 
   const messages = Array.isArray(data?.pages)
     ? data.pages.flatMap((page) => {
-        if (!page || !Array.isArray(page.content)) {
+        if (page || !Array.isArray(page.content)) {
           return [];
         }
killedBy: ChatHistoryPage renders chat messages and shows terminal status when no more pages
statusReason: Unable to find an element by: [data-testid="ChatMessageDisplay-1"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] EqualityOperator
src/main/pages/ChatHistoryPage.jsx:126:28
       })
     : [];
 
-  const isInitialLoading = status === "loading";
+  const isInitialLoading = status !== "loading";
   const showError = status === "error";
 
killedBy: ChatHistoryPage renders chat messages and shows terminal status when no more pages
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="text-center my-3"
>
  <div
    class="spinner-border spinner-border-sm"
    role="status"

[Killed] ConditionalExpression
src/main/pages/ChatHistoryPage.jsx:127:21
     : [];
 
   const isInitialLoading = status === "loading";
-  const showError = status === "error";
+  const showError = true;
 
   return (
killedBy: ChatHistoryPage renders chat messages and shows terminal status when no more pages
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="text-center text-danger my-3"
>
  Unable to load chat messages.
</div> instead

[Killed] ConditionalExpression
src/main/pages/ChatHistoryPage.jsx:142:35
         </Button>
         <div className="d-flex justify-content-between align-items-center mb-3">
           <span className="text-muted">
-            Commons #{commonsId} {readOnly && "• Admin Read Only"}
+            Commons #{commonsId} {false}
           </span>
           <span className="text-muted">Commons #{commonsId}</span>
killedBy: ChatHistoryPage renders read only mode without create form and shows banner
statusReason: Unable to find an element with the text: /Admin Read Only/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
src/main/pages/ChatHistoryPage.jsx:142:35
         </Button>
         <div className="d-flex justify-content-between align-items-center mb-3">
           <span className="text-muted">
-            Commons #{commonsId} {readOnly && "• Admin Read Only"}
+            Commons #{commonsId} {true}
           </span>
           <span className="text-muted">Commons #{commonsId}</span>
killedBy: ChatHistoryPage renders read only mode without create form and shows banner
statusReason: Unable to find an element with the text: /Admin Read Only/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
src/main/pages/ChatHistoryPage.jsx:147:10
           <span className="text-muted">Commons #{commonsId}</span>
         </div>
 
-        {!readOnly && (
-          <div className="mb-4">
-            <ChatMessageCreate commonsId={commonsId} />
-          </div>
-        )}
+        {true}
 
         <div
killedBy: ChatHistoryPage renders create form when not readOnly (default)
statusReason: Unable to find an element by: [data-testid="ChatMessageCreate"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
src/main/pages/ChatHistoryPage.jsx:147:10
           <span className="text-muted">Commons #{commonsId}</span>
         </div>
 
-        {!readOnly && (
-          <div className="mb-4">
-            <ChatMessageCreate commonsId={commonsId} />
-          </div>
-        )}
+        {!readOnly || <div className="mb-4">
+            <ChatMessageCreate commonsId={commonsId} />
+          </div>}
 
         <div
killedBy: ChatHistoryPage renders create form when not readOnly (default)
statusReason: Unable to find an element by: [data-testid="ChatMessageCreate"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ObjectLiteral
src/main/pages/ChatHistoryPage.jsx:154:18
         )}
 
         <div
-          style={{
-            minHeight: "50vh",
-            maxHeight: "70vh",
-            overflowY: "auto",
-            border: "1px solid #dee2e6",
-            borderRadius: "0.5rem",
-            padding: "1rem",
-            backgroundColor: "white",
-          }}
+          style={{}}
           data-testid="ChatHistoryPage-message-container"
         >
killedBy: ChatHistoryPage renders chat messages and shows terminal status when no more pages
statusReason: expect(element).toHaveStyle()

- Expected
+ Received

- min-height: 50vh;

[Killed] StringLiteral
src/main/pages/ChatHistoryPage.jsx:155:24
 
         <div
           style={{
-            minHeight: "50vh",
+            minHeight: "",
             maxHeight: "70vh",
             overflowY: "auto",
killedBy: ChatHistoryPage renders chat messages and shows terminal status when no more pages
statusReason: expect(element).toHaveStyle()

- Expected
+ Received

- min-height: 50vh;

[Killed] StringLiteral
src/main/pages/ChatHistoryPage.jsx:161:30
             border: "1px solid #dee2e6",
             borderRadius: "0.5rem",
             padding: "1rem",
-            backgroundColor: "white",
+            backgroundColor: "",
           }}
           data-testid="ChatHistoryPage-message-container"
killedBy: ChatHistoryPage renders chat messages and shows terminal status when no more pages
statusReason: expect(element).toHaveStyle()

- Expected
+ Received

- background-color: white;

[Killed] ConditionalExpression
src/main/pages/ChatHistoryPage.jsx:171:12
               messages...
             </div>
           )}
-          {showError && (
-            <div className="text-center text-danger my-3">
-              Unable to load chat messages.
-            </div>
-          )}
+          {false}
           {!isInitialLoading && messages.length === 0 && (
             <div className="text-center text-muted my-3">
killedBy: ChatHistoryPage shows error message when chat query fails
statusReason: Unable to find an element with the text: /Unable to load chat messages/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
src/main/pages/ChatHistoryPage.jsx:181:25
               No messages available for this commons.
             </div>
           )}
-          {messages.map((message) => (
-            <div
-              key={message.id}
-              className="d-flex justify-content-between align-items-start mb-2"
-            >
-              <div
-                style={
-                  message.hidden ? { opacity: 0.5, fontStyle: "italic" } : {}
-                }
-              >
-                <ChatMessageDisplay message={message} />
-              </div>
-
-              {isAdmin && (
-                <button
-                  className="btn btn-danger btn-sm ms-2"
-                  data-testid={`ChatHistoryPage-delete-${message.id}`}
-                  onClick={() => handleDelete(message.id)}
-                >
-                  Delete
-                </button>
-              )}
-            </div>
-          ))}
+          {messages.map(() => undefined)}
           <div
             ref={loadMoreRef}
killedBy: ChatHistoryPage renders chat messages and shows terminal status when no more pages
statusReason: Unable to find an element by: [data-testid="ChatMessageDisplay-1"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Survived] ObjectLiteral
src/main/pages/ChatHistoryPage.jsx:188:36
             >
               <div
                 style={
-                  message.hidden ? { opacity: 0.5, fontStyle: "italic" } : {}
+                  message.hidden ? {} : {}
                 }
               >

[Survived] ConditionalExpression
src/main/pages/ChatHistoryPage.jsx:194:16
                 <ChatMessageDisplay message={message} />
               </div>
 
-              {isAdmin && (
-                <button
-                  className="btn btn-danger btn-sm ms-2"
-                  data-testid={`ChatHistoryPage-delete-${message.id}`}
-                  onClick={() => handleDelete(message.id)}
-                >
-                  Delete
-                </button>
-              )}
+              {true}
             </div>
           ))}

[Survived] LogicalOperator
src/main/pages/ChatHistoryPage.jsx:194:16
                 <ChatMessageDisplay message={message} />
               </div>
 
-              {isAdmin && (
-                <button
-                  className="btn btn-danger btn-sm ms-2"
-                  data-testid={`ChatHistoryPage-delete-${message.id}`}
-                  onClick={() => handleDelete(message.id)}
-                >
-                  Delete
-                </button>
-              )}
+              {isAdmin || <button className="btn btn-danger btn-sm ms-2" data-testid={`ChatHistoryPage-delete-${message.id}`} onClick={() => handleDelete(message.id)}>
+                  Delete
+                </button>}
             </div>
           ))}

[NoCoverage] StringLiteral
src/main/pages/ChatHistoryPage.jsx:197:32
               {isAdmin && (
                 <button
                   className="btn btn-danger btn-sm ms-2"
-                  data-testid={`ChatHistoryPage-delete-${message.id}`}
+                  data-testid={``}
                   onClick={() => handleDelete(message.id)}
                 >

[NoCoverage] ArrowFunction
src/main/pages/ChatHistoryPage.jsx:198:28
                 <button
                   className="btn btn-danger btn-sm ms-2"
                   data-testid={`ChatHistoryPage-delete-${message.id}`}
-                  onClick={() => handleDelete(message.id)}
+                  onClick={() => undefined}
                 >
                   Delete

[Killed] StringLiteral
src/main/pages/ChatHistoryPage.jsx:213:19
             {isFetchingNextPage
               ? "Loading more messages..."
               : hasNextPage
-                ? "Scroll to load more messages"
+                ? ""
                 : "[no more messages]"}
           </div>
killedBy: ChatHistoryPage status indicator shows when additional pages are available
statusReason: Unable to find an element with the text: /Scroll to load more messages/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
src/main/pages/ChatHistoryPage.jsx:214:19
               ? "Loading more messages..."
               : hasNextPage
                 ? "Scroll to load more messages"
-                : "[no more messages]"}
+                : ""}
           </div>
         </div>
killedBy: ChatHistoryPage renders chat messages and shows terminal status when no more pages
statusReason: Unable to find an element with the text: [no more messages]. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
src/main/pages/ChatHistoryPage.jsx:217:10
                 : "[no more messages]"}
           </div>
         </div>
-        {isFetching && !isFetchingNextPage && (
-          <div className="text-center text-muted mt-2">
-            Updating conversation...
-          </div>
-        )}
+        {true}
       </div>
     </BasicLayout>
killedBy: ChatHistoryPage shows updating indicator when refreshing current messages
statusReason: Unable to find an element with the text: /Updating conversation/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
