[Killed] BlockStatement
src/main/pages/AdminChatPage.jsx:4:29
 import React from "react";
 import ChatHistoryPage from "main/pages/ChatHistoryPage"; // adjust path if needed
 
-const AdminChatPage = () => {
-  return <ChatHistoryPage readOnly={true} isAdmin={true} />;
-};
+const AdminChatPage = () => {};
 
 export default AdminChatPage;
killedBy: AdminChatPage tests (coverage + Stryker) renders component and child
statusReason: Unable to find an element by: [data-testid="ChatHistoryPageMock"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] BooleanLiteral
src/main/pages/AdminChatPage.jsx:5:37
 import ChatHistoryPage from "main/pages/ChatHistoryPage"; // adjust path if needed
 
 const AdminChatPage = () => {
-  return <ChatHistoryPage readOnly={true} isAdmin={true} />;
+  return <ChatHistoryPage readOnly={false} isAdmin={true} />;
 };
 
killedBy: AdminChatPage tests (coverage + Stryker) passes readOnly=true correctly
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/main/pages/AdminChatPage.jsx:5:52
 import ChatHistoryPage from "main/pages/ChatHistoryPage"; // adjust path if needed
 
 const AdminChatPage = () => {
-  return <ChatHistoryPage readOnly={true} isAdmin={true} />;
+  return <ChatHistoryPage readOnly={true} isAdmin={false} />;
 };
 
killedBy: AdminChatPage tests (coverage + Stryker) passes isAdmin=true correctly
statusReason: expected false to be true // Object.is equality
