[Killed] EqualityOperator
main/components/Announcement/CurrentAnnouncements.jsx:9:25
 export default function CurrentAnnouncements({ announcements }) {
   const [expanded, setExpanded] = useState({});
 
-  if (!announcements || announcements.length === 0) {
+  if (!announcements || announcements.length !== 0) {
     return null;
   }
killedBy: PlayPage tests shows current announcements when user is allowed and announcements are loaded
statusReason: Unable to find an element by: [data-testid="CurrentAnnouncements"]

Ignored nodes: comments, script, style
<body
  class=""
  style="padding-right: 1024px;"
>
  <div>

[Killed] LogicalOperator
main/components/Announcement/CurrentAnnouncements.jsx:9:7
 export default function CurrentAnnouncements({ announcements }) {
   const [expanded, setExpanded] = useState({});
 
-  if (!announcements || announcements.length === 0) {
+  if (!announcements && announcements.length === 0) {
     return null;
   }
killedBy: AdminViewPlayPage tests Make sure that both the Announcements and Welcome Farmer components show up
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
main/components/Announcement/CurrentAnnouncements.jsx:13:34
     return null;
   }
 
-  const toggleExpanded = (id) => {
-    setExpanded((oldExpanded) => ({
-      ...oldExpanded,
-      [id]: !oldExpanded[id],
-    }));
-  };
+  const toggleExpanded = (id) => {};
 
   const getAnnouncementText = (announcement) => {
killedBy: CurrentAnnouncements tests long announcement can be expanded and collapsed
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  This is a very long announcement that should be collapsed because it is longer than one hundred and twenty characters. This part should be hidden at first.
Received:
  This is a very long announcement that should be collapsed because it is longer than one hundred and twenty characters. T...Show more

[Killed] ArrowFunction
main/components/Announcement/CurrentAnnouncements.jsx:14:17
   }
 
   const toggleExpanded = (id) => {
-    setExpanded((oldExpanded) => ({
-      ...oldExpanded,
-      [id]: !oldExpanded[id],
-    }));
+    setExpanded(() => undefined);
   };
 
killedBy: CurrentAnnouncements tests long announcement can be expanded and collapsed
statusReason: Cannot read properties of undefined (reading '1')

[Killed] BooleanLiteral
main/components/Announcement/CurrentAnnouncements.jsx:16:13
   const toggleExpanded = (id) => {
     setExpanded((oldExpanded) => ({
       ...oldExpanded,
-      [id]: !oldExpanded[id],
+      [id]: oldExpanded[id],
     }));
   };
killedBy: CurrentAnnouncements tests long announcement can be expanded and collapsed
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  This is a very long announcement that should be collapsed because it is longer than one hundred and twenty characters. This part should be hidden at first.
Received:
  This is a very long announcement that should be collapsed because it is longer than one hundred and twenty characters. T...Show more

[Killed] BlockStatement
main/components/Announcement/CurrentAnnouncements.jsx:20:49
     }));
   };
 
-  const getAnnouncementText = (announcement) => {
-    return announcement.announcementText || announcement.message || "";
-  };
+  const getAnnouncementText = (announcement) => {};
 
   return (
killedBy: CurrentAnnouncements tests renders a short announcement without show more button
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
main/components/Announcement/CurrentAnnouncements.jsx:21:12
   };
 
   const getAnnouncementText = (announcement) => {
-    return announcement.announcementText || announcement.message || "";
+    return false || "";
   };
 
killedBy: CurrentAnnouncements tests renders a short announcement without show more button
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  This is a short announcement.
Received:

[Killed] ConditionalExpression
main/components/Announcement/CurrentAnnouncements.jsx:21:12
   };
 
   const getAnnouncementText = (announcement) => {
-    return announcement.announcementText || announcement.message || "";
+    return false;
   };
 
killedBy: PlayPage tests shows current announcements when user is allowed and announcements are loaded
statusReason: Unable to find an element with the text: This is a current announcement.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(/src/

[Killed] ConditionalExpression
main/components/Announcement/CurrentAnnouncements.jsx:30:11
         const isExpanded = expanded[announcement.id];
         const announcementText = getAnnouncementText(announcement);
         const shouldCollapse =
-          announcementText.length > MAX_ANNOUNCEMENT_LENGTH;
+          false;
 
         const displayedText =
killedBy: CurrentAnnouncements tests long announcement is collapsed by default
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  This is a very long announcement that should be collapsed because it is longer than one hundred and twenty characters. T...
Received:
  This is a very long announcement that should be collapsed because it is longer than one hundred and twenty characters. This part should be hidden at first.

[Killed] EqualityOperator
main/components/Announcement/CurrentAnnouncements.jsx:30:11
         const isExpanded = expanded[announcement.id];
         const announcementText = getAnnouncementText(announcement);
         const shouldCollapse =
-          announcementText.length > MAX_ANNOUNCEMENT_LENGTH;
+          announcementText.length <= MAX_ANNOUNCEMENT_LENGTH;
 
         const displayedText =
killedBy: CurrentAnnouncements tests renders a short announcement without show more button
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button
  class="p-0 btn btn-link"
  data-testid="CurrentAnnouncements-toggle-1"
  type="button"
>
  Show more

[Killed] LogicalOperator
main/components/Announcement/CurrentAnnouncements.jsx:33:11
           announcementText.length > MAX_ANNOUNCEMENT_LENGTH;
 
         const displayedText =
-          shouldCollapse && !isExpanded
+          shouldCollapse || !isExpanded
             ? `${announcementText.substring(0, MAX_ANNOUNCEMENT_LENGTH)}...`
             : announcementText;
killedBy: PlayPage tests shows current announcements when user is allowed and announcements are loaded
statusReason: Unable to find an element with the text: This is a current announcement.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(/src/

[Killed] BooleanLiteral
main/components/Announcement/CurrentAnnouncements.jsx:33:29
           announcementText.length > MAX_ANNOUNCEMENT_LENGTH;
 
         const displayedText =
-          shouldCollapse && !isExpanded
+          shouldCollapse && isExpanded
             ? `${announcementText.substring(0, MAX_ANNOUNCEMENT_LENGTH)}...`
             : announcementText;
killedBy: CurrentAnnouncements tests long announcement is collapsed by default
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  This is a very long announcement that should be collapsed because it is longer than one hundred and twenty characters. T...
Received:
  This is a very long announcement that should be collapsed because it is longer than one hundred and twenty characters. This part should be hidden at first.Show more

[Killed] MethodExpression
main/components/Announcement/CurrentAnnouncements.jsx:34:18
 
         const displayedText =
           shouldCollapse && !isExpanded
-            ? `${announcementText.substring(0, MAX_ANNOUNCEMENT_LENGTH)}...`
+            ? `${announcementText}...`
             : announcementText;
 
killedBy: CurrentAnnouncements tests long announcement is collapsed by default
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  This is a very long announcement that should be collapsed because it is longer than one hundred and twenty characters. T...
Received:
  This is a very long announcement that should be collapsed because it is longer than one hundred and twenty characters. This part should be hidden at first....Show more

[Killed] StringLiteral
main/components/Announcement/CurrentAnnouncements.jsx:34:15
 
         const displayedText =
           shouldCollapse && !isExpanded
-            ? `${announcementText.substring(0, MAX_ANNOUNCEMENT_LENGTH)}...`
+            ? ``
             : announcementText;
 
killedBy: CurrentAnnouncements tests long announcement is collapsed by default
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  This is a very long announcement that should be collapsed because it is longer than one hundred and twenty characters. T...
Received:
  Show more

[Killed] StringLiteral
main/components/Announcement/CurrentAnnouncements.jsx:41:26
           <div
             key={announcement.id}
             className="mb-2"
-            data-testid={`CurrentAnnouncements-announcement-${announcement.id}`}
+            data-testid={``}
           >
             <div>{displayedText}</div>
killedBy: CurrentAnnouncements tests renders a short announcement without show more button
statusReason: Unable to find an element by: [data-testid="CurrentAnnouncements-announcement-1"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="mb-3"
      data-testid="CurrentAnnouncements"

[Killed] ConditionalExpression
main/components/Announcement/CurrentAnnouncements.jsx:45:14
           >
             <div>{displayedText}</div>
 
-            {shouldCollapse && (
-              <Button
-                variant="link"
-                className="p-0"
-                onClick={() => toggleExpanded(announcement.id)}
-                data-testid={`CurrentAnnouncements-toggle-${announcement.id}`}
-              >
-                {isExpanded ? "Show less" : "Show more"}
-              </Button>
-            )}
+            {true}
           </div>
         );
killedBy: CurrentAnnouncements tests long announcement is collapsed by default
statusReason: Unable to find an element by: [data-testid="CurrentAnnouncements-toggle-1"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="mb-3"
      data-testid="CurrentAnnouncements"

[Killed] LogicalOperator
main/components/Announcement/CurrentAnnouncements.jsx:45:14
           >
             <div>{displayedText}</div>
 
-            {shouldCollapse && (
-              <Button
-                variant="link"
-                className="p-0"
-                onClick={() => toggleExpanded(announcement.id)}
-                data-testid={`CurrentAnnouncements-toggle-${announcement.id}`}
-              >
-                {isExpanded ? "Show less" : "Show more"}
-              </Button>
-            )}
+            {shouldCollapse || <Button variant="link" className="p-0" onClick={() => toggleExpanded(announcement.id)} data-testid={`CurrentAnnouncements-toggle-${announcement.id}`}>
+                {isExpanded ? "Show less" : "Show more"}
+              </Button>}
           </div>
         );
killedBy: CurrentAnnouncements tests renders a short announcement without show more button
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button
  class="p-0 btn btn-link"
  data-testid="CurrentAnnouncements-toggle-1"
  type="button"
>
  Show more

[Killed] ArrowFunction
main/components/Announcement/CurrentAnnouncements.jsx:49:26
               <Button
                 variant="link"
                 className="p-0"
-                onClick={() => toggleExpanded(announcement.id)}
+                onClick={() => undefined}
                 data-testid={`CurrentAnnouncements-toggle-${announcement.id}`}
               >
killedBy: CurrentAnnouncements tests long announcement can be expanded and collapsed
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  This is a very long announcement that should be collapsed because it is longer than one hundred and twenty characters. This part should be hidden at first.
Received:
  This is a very long announcement that should be collapsed because it is longer than one hundred and twenty characters. T...Show more

[Killed] StringLiteral
main/components/Announcement/CurrentAnnouncements.jsx:52:31
                 onClick={() => toggleExpanded(announcement.id)}
                 data-testid={`CurrentAnnouncements-toggle-${announcement.id}`}
               >
-                {isExpanded ? "Show less" : "Show more"}
+                {isExpanded ? "" : "Show more"}
               </Button>
             )}
killedBy: CurrentAnnouncements tests long announcement can be expanded and collapsed
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Show less
Received:

[Killed] StringLiteral
main/components/Announcement/CurrentAnnouncements.jsx:52:45
                 onClick={() => toggleExpanded(announcement.id)}
                 data-testid={`CurrentAnnouncements-toggle-${announcement.id}`}
               >
-                {isExpanded ? "Show less" : "Show more"}
+                {isExpanded ? "Show less" : ""}
               </Button>
             )}
killedBy: CurrentAnnouncements tests long announcement is collapsed by default
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Show more
Received:
