[Killed] LogicalOperator
main/components/Commons/CommonsOverview.jsx:22:5
   // Stryker restore all
 
   const showLeaderboard =
-    hasRole(currentUser, "ROLE_ADMIN") || commonsPlus.commons.showLeaderboard;
+    hasRole(currentUser, "ROLE_ADMIN") && commonsPlus.commons.showLeaderboard;
 
   return (
killedBy: CommonsOverview tests Redirects to the LeaderboardPage for an admin when you click visit
statusReason: Unable to find an element by: [data-testid="user-leaderboard-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="card"
      data-testid="CommonsOverview"
