[Killed] BooleanLiteral
src/main/pages/PlayPage.jsx:191:24
             <h1>This commons has been hidden by the site administrator.</h1>
           )}
 
-          {allowed && !!currentUser && (
+          {allowed && !currentUser && (
             <CommonsPlay currentUser={currentUser} />
           )}
killedBy: PlayPage tests renders without crashing
statusReason: Unable to find an element by: [data-testid="commonsPlay-title"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(/src/assets/PlayPageBackground.jpg);"

[Killed] ConditionalExpression
src/main/pages/PlayPage.jsx:191:12
             <h1>This commons has been hidden by the site administrator.</h1>
           )}
 
-          {allowed && !!currentUser && (
-            <CommonsPlay currentUser={currentUser} />
-          )}
+          {false}
 
           {allowed && !!commonsPlus && (
killedBy: PlayPage tests renders without crashing
statusReason: Unable to find an element by: [data-testid="commonsPlay-title"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(/src/assets/PlayPageBackground.jpg);"

[Killed] ConditionalExpression
src/main/pages/PlayPage.jsx:195:12
             <CommonsPlay currentUser={currentUser} />
           )}
 
-          {allowed && !!commonsPlus && (
-            <CommonsOverview
-              commonsPlus={commonsPlus}
-              currentUser={currentUser}
-              currentAnnouncements={currentAnnouncements}
-            />
-          )}
+          {false}
 
           <br />
killedBy: PlayPage tests renders without crashing
statusReason: Unable to find an element by: [data-testid="CommonsOverview"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(/src/assets/PlayPageBackground.jpg);"

[Killed] ConditionalExpression
src/main/pages/PlayPage.jsx:195:12
             <CommonsPlay currentUser={currentUser} />
           )}
 
-          {allowed && !!commonsPlus && (
-            <CommonsOverview
-              commonsPlus={commonsPlus}
-              currentUser={currentUser}
-              currentAnnouncements={currentAnnouncements}
-            />
-          )}
+          {true}
 
           <br />
killedBy: PlayPage tests renders without crashing
statusReason: Unable to find an element by: [data-testid="CommonsOverview"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(/src/assets/PlayPageBackground.jpg);"

[Killed] ConditionalExpression
src/main/pages/PlayPage.jsx:205:12
 
           <br />
 
-          {allowed && !!userCommons && !!commonsPlus && (
-            <CardGroup>
-              <ManageCows
-                userCommons={userCommons}
-                commons={commonsPlus.commons}
-                setMessage={setMessage}
-                openModal={openModal}
-              />
-              <FarmStats userCommons={userCommons} />
-              <Profits userCommons={userCommons} profits={userCommonsProfits} />
-              <ManageCowsModal
-                number={numCows}
-                setNumber={setNumCows}
-                userCommons={userCommons}
-                isOpen={isModalOpen}
-                message={message}
-                onClose={closeModal}
-                onBuy={onBuy}
-                onSell={onSell}
-              />
-            </CardGroup>
-          )}
+          {false}
         </Container>
       </BasicLayout>
killedBy: PlayPage tests renders without crashing
statusReason: Unable to find an element by: [data-testid="ManageCows"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(/src/assets/PlayPageBackground.jpg);"

[Killed] ConditionalExpression
src/main/pages/PlayPage.jsx:205:12
 
           <br />
 
-          {allowed && !!userCommons && !!commonsPlus && (
-            <CardGroup>
-              <ManageCows
-                userCommons={userCommons}
-                commons={commonsPlus.commons}
-                setMessage={setMessage}
-                openModal={openModal}
-              />
-              <FarmStats userCommons={userCommons} />
-              <Profits userCommons={userCommons} profits={userCommonsProfits} />
-              <ManageCowsModal
-                number={numCows}
-                setNumber={setNumCows}
-                userCommons={userCommons}
-                isOpen={isModalOpen}
-                message={message}
-                onClose={closeModal}
-                onBuy={onBuy}
-                onSell={onSell}
-              />
-            </CardGroup>
-          )}
+          {true}
         </Container>
       </BasicLayout>
killedBy: PlayPage tests renders without crashing
statusReason: Unable to find an element by: [data-testid="ManageCows"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(/src/assets/PlayPageBackground.jpg);"

[Killed] LogicalOperator
src/main/pages/PlayPage.jsx:230:8
         </Container>
       </BasicLayout>
 
-      {(hasRole(currentUser, "ROLE_ADMIN") ||
-        (allowed && !!commonsPlus && commonsPlus.commons.showChat)) && (
-        <div style={chatContainerStyle} data-testid="playpage-chat-div">
-          {!!isChatOpen && <ChatPanel commonsId={commonsId} />}
-          <Button
-            style={chatButtonStyle}
-            onClick={toggleChatWindow}
-            data-testid="playpage-chat-toggle"
-          >
-            {isChatOpen ? (
-              <span style={emojiStyle} data-testid="close-icon">
-                ❌
-              </span>
-            ) : (
-              <span style={emojiStyle} data-testid="message-icon">
-                💬
-              </span>
-            )}
-          </Button>
-        </div>
-      )}
+      {hasRole(currentUser, "ROLE_ADMIN") || allowed && !!commonsPlus && commonsPlus.commons.showChat || <div style={chatContainerStyle} data-testid="playpage-chat-div">
+          {!!isChatOpen && <ChatPanel commonsId={commonsId} />}
+          <Button style={chatButtonStyle} onClick={toggleChatWindow} data-testid="playpage-chat-toggle">
+            {isChatOpen ? <span style={emojiStyle} data-testid="close-icon">
+                ❌
+              </span> : <span style={emojiStyle} data-testid="message-icon">
+                💬
+              </span>}
+          </Button>
+        </div>}
     </div>
   );
killedBy: PlayPage tests renders without crashing
statusReason: Unable to find an element by: [data-testid="playpage-chat-div"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(/src/assets/PlayPageBackground.jpg);"

[Killed] ConditionalExpression
src/main/pages/PlayPage.jsx:230:8
         </Container>
       </BasicLayout>
 
-      {(hasRole(currentUser, "ROLE_ADMIN") ||
-        (allowed && !!commonsPlus && commonsPlus.commons.showChat)) && (
-        <div style={chatContainerStyle} data-testid="playpage-chat-div">
-          {!!isChatOpen && <ChatPanel commonsId={commonsId} />}
-          <Button
-            style={chatButtonStyle}
-            onClick={toggleChatWindow}
-            data-testid="playpage-chat-toggle"
-          >
-            {isChatOpen ? (
-              <span style={emojiStyle} data-testid="close-icon">
-                ❌
-              </span>
-            ) : (
-              <span style={emojiStyle} data-testid="message-icon">
-                💬
-              </span>
-            )}
-          </Button>
-        </div>
-      )}
+      {true}
     </div>
   );
killedBy: PlayPage tests renders without crashing
statusReason: Unable to find an element by: [data-testid="playpage-chat-div"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(/src/assets/PlayPageBackground.jpg);"

[Killed] ConditionalExpression
src/main/pages/PlayPage.jsx:231:10
       </BasicLayout>
 
       {(hasRole(currentUser, "ROLE_ADMIN") ||
-        (allowed && !!commonsPlus && commonsPlus.commons.showChat)) && (
+        (true && commonsPlus.commons.showChat)) && (
         <div style={chatContainerStyle} data-testid="playpage-chat-div">
           {!!isChatOpen && <ChatPanel commonsId={commonsId} />}
killedBy: PlayPage tests renders without crashing
statusReason: Cannot read properties of undefined (reading 'commons')
