[Killed] LogicalOperator
src/main/pages/PlayPage.jsx:192:12
             <h1>This commons has been hidden by the site administrator.</h1>
           )}
 
-          {allowed && !!currentAnnouncements && (
+          {allowed || !!currentAnnouncements && (
             <CurrentAnnouncements announcements={currentAnnouncements} />
           )}
killedBy: PlayPage tests does not show current announcements when user is not allowed
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div>
  This announcement should not show.
</div> instead

[Killed] LogicalOperator
src/main/pages/PlayPage.jsx:192:12
             <h1>This commons has been hidden by the site administrator.</h1>
           )}
 
-          {allowed && !!currentAnnouncements && (
-            <CurrentAnnouncements announcements={currentAnnouncements} />
-          )}
+          {allowed && !!currentAnnouncements || <CurrentAnnouncements announcements={currentAnnouncements} />}
 
           {allowed && !!currentUser && (
killedBy: PlayPage tests shows current announcements when user is allowed and announcements are loaded
statusReason: Unable to find an element by: [data-testid="CurrentAnnouncements"]

Ignored nodes: comments, script, style
<body
  class=""
  style="padding-right: 1024px;"
>
  <div>

[Killed] ConditionalExpression
src/main/pages/PlayPage.jsx:200:12
             <CommonsPlay currentUser={currentUser} />
           )}
 
-          {allowed && !!commonsPlus && (
-            <CommonsOverview
-              commonsPlus={commonsPlus}
-              currentUser={currentUser}
-            />
-          )}
+          {false}
           <br />
           {allowed && !!userCommons && !!commonsPlus && (
killedBy: PlayPage tests renders without crashing
statusReason: Unable to find an element by: [data-testid="CommonsOverview"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(/src/assets/PlayPageBackground.jpg);"

[Killed] ConditionalExpression
src/main/pages/PlayPage.jsx:207:12
             />
           )}
           <br />
-          {allowed && !!userCommons && !!commonsPlus && (
-            <CardGroup>
-              <ManageCows
-                userCommons={userCommons}
-                commons={commonsPlus.commons}
-                setMessage={setMessage}
-                openModal={openModal}
-              />
-              <FarmStats userCommons={userCommons} />
-              <Profits userCommons={userCommons} profits={userCommonsProfits} />
-              <ManageCowsModal
-                number={numCows}
-                setNumber={setNumCows}
-                userCommons={userCommons}
-                isOpen={isModalOpen}
-                message={message}
-                onClose={closeModal}
-                onBuy={onBuy}
-                onSell={onSell}
-              />
-            </CardGroup>
-          )}
+          {true}
         </Container>
       </BasicLayout>
killedBy: PlayPage tests renders without crashing
statusReason: Unable to find an element by: [data-testid="ManageCows"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(/src/assets/PlayPageBackground.jpg);"

[Killed] ConditionalExpression
src/main/pages/PlayPage.jsx:207:12
             />
           )}
           <br />
-          {allowed && !!userCommons && !!commonsPlus && (
+          {true && (
             <CardGroup>
               <ManageCows
killedBy: PlayPage tests renders without crashing
statusReason: Cannot read properties of undefined (reading 'commons')
