[Killed] BooleanLiteral
main/components/Announcement/CurrentAnnouncements.jsx:7:7
 export default function CurrentAnnouncements({ announcements }) {
   const [expanded, setExpanded] = useState({});
 
-  if (!announcements || announcements.length === 0) {
+  if (announcements || announcements.length === 0) {
     return null;
   }
killedBy: CurrentAnnouncements tests does not render when announcements is undefined
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
main/components/Announcement/CurrentAnnouncements.jsx:7:7
 export default function CurrentAnnouncements({ announcements }) {
   const [expanded, setExpanded] = useState({});
 
-  if (!announcements || announcements.length === 0) {
+  if (true) {
     return null;
   }
killedBy: PlayPage tests shows current announcements when user is allowed and announcements are loaded
statusReason: Unable to find an element by: [data-testid="CurrentAnnouncements"]

Ignored nodes: comments, script, style
<body
  class=""
  style="padding-right: 1024px;"
>
  <div>

[Killed] EqualityOperator
main/components/Announcement/CurrentAnnouncements.jsx:23:32
       {announcements.map((announcement) => {
         const isExpanded = expanded[announcement.id];
         const announcementText = announcement.announcementText;
-        const shouldCollapse = announcementText.length > 120;
+        const shouldCollapse = announcementText.length <= 120;
 
         const displayedText =
killedBy: CurrentAnnouncements tests renders a short announcement without show more button
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button
  class="p-0 btn btn-link"
  data-testid="CurrentAnnouncements-toggle-1"
  type="button"
>
  Show more

[Killed] ConditionalExpression
main/components/Announcement/CurrentAnnouncements.jsx:23:32
       {announcements.map((announcement) => {
         const isExpanded = expanded[announcement.id];
         const announcementText = announcement.announcementText;
-        const shouldCollapse = announcementText.length > 120;
+        const shouldCollapse = false;
 
         const displayedText =
killedBy: CurrentAnnouncements tests long announcement is collapsed by default
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  This is a very long announcement that should be collapsed because it is longer than one hundred and twenty characters. T...
Received:
  This is a very long announcement that should be collapsed because it is longer than one hundred and twenty characters. This part should be hidden at first.

[Killed] ConditionalExpression
main/components/Announcement/CurrentAnnouncements.jsx:26:11
         const shouldCollapse = announcementText.length > 120;
 
         const displayedText =
-          shouldCollapse && !isExpanded
+          true
             ? `${announcementText.substring(0, 120)}...`
             : announcementText;
killedBy: CurrentAnnouncements tests long announcement can be expanded and collapsed
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  This is a very long announcement that should be collapsed because it is longer than one hundred and twenty characters. This part should be hidden at first.
Received:
  This is a very long announcement that should be collapsed because it is longer than one hundred and twenty characters. T...Show less

[Killed] MethodExpression
main/components/Announcement/CurrentAnnouncements.jsx:27:18
 
         const displayedText =
           shouldCollapse && !isExpanded
-            ? `${announcementText.substring(0, 120)}...`
+            ? `${announcementText}...`
             : announcementText;
 
killedBy: CurrentAnnouncements tests long announcement is collapsed by default
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  This is a very long announcement that should be collapsed because it is longer than one hundred and twenty characters. T...
Received:
  This is a very long announcement that should be collapsed because it is longer than one hundred and twenty characters. This part should be hidden at first....Show more

[Killed] StringLiteral
main/components/Announcement/CurrentAnnouncements.jsx:27:15
 
         const displayedText =
           shouldCollapse && !isExpanded
-            ? `${announcementText.substring(0, 120)}...`
+            ? ``
             : announcementText;
 
killedBy: CurrentAnnouncements tests long announcement is collapsed by default
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  This is a very long announcement that should be collapsed because it is longer than one hundred and twenty characters. T...
Received:
  Show more
