[Killed] ConditionalExpression
main/components/Announcement/AnnouncementForm.jsx:27:5
   const announcementText = watch("announcementText");
   const announcementTextMaxLengthMessage = `Announcement must be ${ANNOUNCEMENT_TEXT_MAX_LENGTH} characters or fewer.`;
   const atMaxAnnouncementLength =
-    (announcementText?.length ?? 0) >= ANNOUNCEMENT_TEXT_MAX_LENGTH;
+    false;
   const announcementTextInvalid =
     Boolean(errors.announcementText) || atMaxAnnouncementLength;
killedBy: AnnouncementForm tests shows max length error when announcement reaches character limit
statusReason: Unable to find an element with the text: Announcement must be 255 characters or fewer.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] OptionalChaining
main/components/Announcement/AnnouncementForm.jsx:27:6
   const announcementText = watch("announcementText");
   const announcementTextMaxLengthMessage = `Announcement must be ${ANNOUNCEMENT_TEXT_MAX_LENGTH} characters or fewer.`;
   const atMaxAnnouncementLength =
-    (announcementText?.length ?? 0) >= ANNOUNCEMENT_TEXT_MAX_LENGTH;
+    (announcementText.length ?? 0) >= ANNOUNCEMENT_TEXT_MAX_LENGTH;
   const announcementTextInvalid =
     Boolean(errors.announcementText) || atMaxAnnouncementLength;
killedBy: AnnouncementForm tests renders correctly with no initialContents
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
main/components/Announcement/AnnouncementForm.jsx:29:5
   const atMaxAnnouncementLength =
     (announcementText?.length ?? 0) >= ANNOUNCEMENT_TEXT_MAX_LENGTH;
   const announcementTextInvalid =
-    Boolean(errors.announcementText) || atMaxAnnouncementLength;
+    false;
 
   // For explanation, see: https://stackoverflow.com/questions/3143070/javascript-regex-iso-datetime
killedBy: AnnouncementForm tests shows max length error when announcement reaches character limit
statusReason: expect(element).toHaveClass("is-invalid")

Expected the element to have class:
  is-invalid
Received:
  form-control

[Killed] ConditionalExpression
main/components/Announcement/AnnouncementForm.jsx:43:8
 
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
-      {initialContents && (
-        <Form.Group className="mb-3">
-          <Form.Label htmlFor="id">Id</Form.Label>
-          <Form.Control
-            // Stryker disable next-line all
-            data-testid={testIdPrefix + "-id"}
-            id="id"
-            type="text"
-            {...register("id")}
-            value={initialContents.id}
-            disabled
-          />
-        </Form.Group>
-      )}
+      {false}
 
       <Form.Group className="mb-3">
killedBy: AnnouncementForm tests renders correctly when passing in initialContents
statusReason: Unable to find an element by: [data-testid="AnnouncementForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/Announcement/AnnouncementForm.jsx:67:23
           type="datetime-local"
           isInvalid={Boolean(errors.startDate)}
           {...register("startDate", {
-            required: "StartDate is required.",
+            required: "",
             pattern: isodate_regex,
           })}
killedBy: AnnouncementForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Start Date is required and must be provided in ISO format./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/Announcement/AnnouncementForm.jsx:89:15
           {...register("endDate", {
             pattern: isodate_regex,
             validate: (value) =>
-              !value ||
-              !startDate ||
-              value > startDate ||
-              "End Date must be after Start Date.",
+              (!value || !startDate || value > startDate) && "End Date must be after Start Date.",
           })}
         />
killedBy: AnnouncementForm tests calls submitAction when form is valid
statusReason: expected "spy" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <form

[Killed] ConditionalExpression
main/components/Announcement/AnnouncementForm.jsx:89:15
           {...register("endDate", {
             pattern: isodate_regex,
             validate: (value) =>
-              !value ||
-              !startDate ||
-              value > startDate ||
-              "End Date must be after Start Date.",
+              false,
           })}
         />
killedBy: AnnouncementForm tests calls submitAction when form is valid
statusReason: expected "spy" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <form

[Killed] ConditionalExpression
main/components/Announcement/AnnouncementForm.jsx:91:15
             validate: (value) =>
               !value ||
               !startDate ||
-              value > startDate ||
+              false ||
               "End Date must be after Start Date.",
           })}
killedBy: AnnouncementForm tests calls submitAction with end date when provided
statusReason: expected "spy" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <form

[Killed] StringLiteral
main/components/Announcement/AnnouncementForm.jsx:110:24
           rows={5}
           maxLength={ANNOUNCEMENT_TEXT_MAX_LENGTH}
           isInvalid={announcementTextInvalid}
-          {...register("announcementText", {
+          {...register("", {
             required: "Announcement is required.",
             maxLength: {
killedBy: AnnouncementForm tests renders correctly with no initialContents
statusReason: Cannot read properties of undefined (reading '_f')

[Killed] ConditionalExpression
main/components/Announcement/AnnouncementForm.jsx:119:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.announcementText?.message ||
-            (atMaxAnnouncementLength && announcementTextMaxLengthMessage)}
+          {false}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: AnnouncementForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Announcement is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
