[Killed] ObjectLiteral
src/main/pages/AdminAnnouncementsPage.jsx:51:43
   return (
     <BasicLayout>
       <div className="pt-2">
-        <Row className="pt-5 pb-3" style={{ gap: "30px" }}>
+        <Row className="pt-5 pb-3" style={{}}>
           <Col md="auto">
             <h2>Announcements for Commons: {commonsName}</h2>
killedBy: AdminAnnouncementsPage tests renders page without crashing
statusReason: expect(element).toHaveStyle()

- Expected
+ Received

- gap: 30px;
