[Killed] BlockStatement
src/main/pages/AdminCreateAnnouncementsPage.jsx:28:52
 
   const commonsName = commonsPlus?.commons.name;
 
-  const objectToAxiosParams = (newAnnouncement) => {
-    const params = {
-      commonsId,
-      startDate: datetimeLocalToIsoDateTime(newAnnouncement.startDate),
-      announcementText: newAnnouncement.announcementText,
-    };
-    if (newAnnouncement.endDate) {
-      params.endDate = datetimeLocalToIsoDateTime(newAnnouncement.endDate);
-    }
-    return {
-      url: "/api/announcements/post",
-      method: "POST",
-      params,
-    };
-  };
+  const objectToAxiosParams = (newAnnouncement) => {};
 
   const onSuccess = (newAnnouncement) => {
killedBy: AdminCreateAnnouncementsPage tests create mutation is configured with correct API request and invalidate key
statusReason: expected undefined to deeply equal { Object (url, method, ...) }

[Killed] BlockStatement
src/main/pages/AdminCreateAnnouncementsPage.jsx:34:34
       startDate: datetimeLocalToIsoDateTime(newAnnouncement.startDate),
       announcementText: newAnnouncement.announcementText,
     };
-    if (newAnnouncement.endDate) {
-      params.endDate = datetimeLocalToIsoDateTime(newAnnouncement.endDate);
-    }
+    if (newAnnouncement.endDate) {}
     return {
       url: "/api/announcements/post",
killedBy: AdminCreateAnnouncementsPage tests create mutation is configured with correct API request and invalidate key
statusReason: expected { Object (url, method, ...) } to deeply equal { Object (url, method, ...) }

[Killed] ConditionalExpression
src/main/pages/AdminCreateAnnouncementsPage.jsx:34:9
       startDate: datetimeLocalToIsoDateTime(newAnnouncement.startDate),
       announcementText: newAnnouncement.announcementText,
     };
-    if (newAnnouncement.endDate) {
+    if (false) {
       params.endDate = datetimeLocalToIsoDateTime(newAnnouncement.endDate);
     }
killedBy: AdminCreateAnnouncementsPage tests create mutation is configured with correct API request and invalidate key
statusReason: expected { Object (url, method, ...) } to deeply equal { Object (url, method, ...) }

[Killed] BlockStatement
src/main/pages/AdminCreateAnnouncementsPage.jsx:44:42
     };
   };
 
-  const onSuccess = (newAnnouncement) => {
-    toast(
-      <div>
-        Announcement successfully created!
-        <br />
-        {`commonsId: ${newAnnouncement.id}`}
-        <br />
-        {`startDate: ${newAnnouncement.startDate}`}
-        <br />
-        {`endDate: ${newAnnouncement.endDate}`}
-        <br />
-        {`announcementText: ${newAnnouncement.announcementText}`}
-      </div>,
-    );
-  };
+  const onSuccess = (newAnnouncement) => {};
 
   // Stryker disable all
killedBy: AdminCreateAnnouncementsPage tests onSuccess shows toast with announcement details
statusReason: expected "spy" to be called with arguments: [ { …(9) } ]

Number of calls: 0

[Killed] StringLiteral
src/main/pages/AdminCreateAnnouncementsPage.jsx:51:10
         <br />
         {`commonsId: ${newAnnouncement.id}`}
         <br />
-        {`startDate: ${newAnnouncement.startDate}`}
+        {``}
         <br />
         {`endDate: ${newAnnouncement.endDate}`}
killedBy: AdminCreateAnnouncementsPage tests onSuccess shows toast with announcement details
statusReason: expected "spy" to be called with arguments: [ { …(9) } ]

Received: 

  1st spy call:

@@ -2,11 +2,10 @@
    <div>
