[Killed] BlockStatement
main/components/Announcement/AnnouncementTable.jsx:19:34
 }) {
   const navigate = useNavigate();
 
-  const editCallback = (cell) => {
-    navigate(`/admin/announcements/${commonsId}/edit/${cell.row.values.id}`);
-  };
+  const editCallback = (cell) => {};
 
   const deleteMutation = useBackendMutation(
killedBy: AnnouncementTable tests Edit button navigates to the edit page
statusReason: expected "spy" to be called with arguments: [ '/admin/announcements/1/edit/1' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/components/Announcement/AnnouncementTable.jsx:20:14
   const navigate = useNavigate();
 
   const editCallback = (cell) => {
-    navigate(`/admin/announcements/${commonsId}/edit/${cell.row.values.id}`);
+    navigate(``);
   };
 
killedBy: AnnouncementTable tests Edit button navigates to the edit page
statusReason: expected "spy" to be called with arguments: [ '/admin/announcements/1/edit/1' ]

Received: 

  1st spy call:

  [
-   "/admin/announcements/1/edit/1",

[Killed] ArrayDeclaration
main/components/Announcement/AnnouncementTable.jsx:33:19
     deleteMutation.mutate(cell);
   };
 
-  const columns = [
-    {
-      Header: "id",
-      accessor: "id",
-    },
-    {
-      Header: "Start Date",
-      accessor: "startDate",
-      Cell: ({ value }) => formatDateTime(value),
-    },
-    {
-      Header: "End Date",
-      accessor: "endDate",
-      Cell: ({ value }) => formatDateTime(value),
-    },
-  ];
+  const columns = [];
 
   if (hasRole(currentUser, "ROLE_ADMIN")) {
killedBy: AnnouncementTable tests renders empty table correctly
statusReason: Unable to find an element with the text: id. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >

[Killed] ArrowFunction
main/components/Announcement/AnnouncementTable.jsx:41:13
     {
       Header: "Start Date",
       accessor: "startDate",
-      Cell: ({ value }) => formatDateTime(value),
+      Cell: () => undefined,
     },
     {
killedBy: AnnouncementTable tests Has the expected column headers, content and buttons for admin user
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  12/12/2024, 12:00 AM
Received:

[Killed] StringLiteral
main/components/Announcement/AnnouncementTable.jsx:44:15
       Cell: ({ value }) => formatDateTime(value),
     },
     {
-      Header: "End Date",
+      Header: "",
       accessor: "endDate",
       Cell: ({ value }) => formatDateTime(value),
killedBy: AnnouncementTable tests renders empty table correctly
statusReason: Unable to find an element with the text: End Date. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >

[Survived] ArrowFunction
main/components/Announcement/AnnouncementTable.jsx:46:13
     {
       Header: "End Date",
       accessor: "endDate",
-      Cell: ({ value }) => formatDateTime(value),
+      Cell: () => undefined,
     },
   ];

[Killed] StringLiteral
main/components/Announcement/AnnouncementTable.jsx:60:13
   }
 
   columns.push({
-    Header: "Announcement",
+    Header: "",
     accessor: "announcementText",
     width: 400,
killedBy: AnnouncementTable tests renders empty table correctly
statusReason: Unable to find an element with the text: Announcement. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >

[Killed] ArrowFunction
main/components/Announcement/AnnouncementTable.jsx:63:11
     Header: "Announcement",
     accessor: "announcementText",
     width: 400,
-    Cell: ({ value }) => (
-      <div
-        style={{
-          whiteSpace: "normal",
-          wordBreak: "break-word",
-          maxWidth: "400px",
-        }}
-      >
-        {value}
-      </div>
-    ),
+    Cell: () => undefined,
   });
 
killedBy: AdminAnnouncementsPage tests renders announcements table with data from the API
statusReason: Unable to find an element with the text: System maintenance scheduled for next week.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Survived] StringLiteral
main/components/Announcement/AnnouncementTable.jsx:68:21
         style={{
           whiteSpace: "normal",
           wordBreak: "break-word",
-          maxWidth: "400px",
+          maxWidth: "",
         }}
       >
