[Killed] BlockStatement
src/main/pages/AdminEditAnnouncementsPage.jsx:5:54
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 import { useParams } from "react-router";
 
-export default function AdminEditAnnouncementsPage() {
-  const { commonsId, announcementId } = useParams();
-
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Edit Announcement</h1>
-        <h2>Not implemented yet; coming soon!</h2>
-        <p>Commons ID: {commonsId}</p>
-        <p>Announcement ID: {announcementId}</p>
-      </div>
-    </BasicLayout>
-  );
-}
+export default function AdminEditAnnouncementsPage() {}
 
killedBy: AdminEditAnnouncementsPage tests renders page with the announcement ids
statusReason: Unable to find an element with the text: Edit Announcement. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>
