[Killed] BlockStatement
src/main/utils/dateUtils.js:28:48
 const dayInSeconds = 24 * hourInSeconds;
 const weekInSeconds = 7 * dayInSeconds;
 
-export function formatDateTime(dateTimeString) {
-  if (!dateTimeString) {
-    return "";
-  }
-
-  const date = new Date(dateTimeString);
-  if (Number.isNaN(date.getTime())) {
-    return "";
-  }
-
-  return new Intl.DateTimeFormat("en-US", {
-    year: "numeric",
-    month: "2-digit",
-    day: "2-digit",
-    hour: "numeric",
-    minute: "2-digit",
-    hour12: true,
-  }).format(date);
-}
+export function formatDateTime(dateTimeString) {}
 
 export function formatTime(timeString) {
killedBy: AnnouncementTable tests Has the expected column headers, content and buttons for admin user
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  undefined
Received:

[Killed] ConditionalExpression
src/main/utils/dateUtils.js:29:7
 const weekInSeconds = 7 * dayInSeconds;
 
 export function formatDateTime(dateTimeString) {
-  if (!dateTimeString) {
+  if (true) {
     return "";
   }
killedBy: dateUtils tests formatDateTime tests formats ISO date-time without seconds or timezone
statusReason: expected '' to match /12\/12\/2024, 12:00 AM/12\

[Killed] BooleanLiteral
src/main/utils/dateUtils.js:29:7
 const weekInSeconds = 7 * dayInSeconds;
 
 export function formatDateTime(dateTimeString) {
-  if (!dateTimeString) {
+  if (dateTimeString) {
     return "";
   }
killedBy: dateUtils tests formatDateTime tests should return empty string for null or empty input
statusReason: expected '12/31/1969, 4:00 PM' to deeply equal ''

[Killed] ConditionalExpression
src/main/utils/dateUtils.js:34:7
   }
 
   const date = new Date(dateTimeString);
-  if (Number.isNaN(date.getTime())) {
+  if (false) {
     return "";
   }
killedBy: dateUtils tests formatDateTime tests should return empty string for invalid date
statusReason: Invalid time value

[Killed] ConditionalExpression
src/main/utils/dateUtils.js:34:7
   }
 
   const date = new Date(dateTimeString);
-  if (Number.isNaN(date.getTime())) {
+  if (true) {
     return "";
   }
killedBy: dateUtils tests formatDateTime tests formats ISO date-time without seconds or timezone
statusReason: expected '' to match /12\/12\/2024, 12:00 AM/12\

[Killed] StringLiteral
src/main/utils/dateUtils.js:41:10
   return new Intl.DateTimeFormat("en-US", {
     year: "numeric",
     month: "2-digit",
-    day: "2-digit",
+    day: "",
     hour: "numeric",
     minute: "2-digit",
killedBy: dateUtils tests formatDateTime tests formats ISO date-time without seconds or timezone
statusReason: Value  out of range for Intl.DateTimeFormat options property day

[Killed] StringLiteral
src/main/utils/dateUtils.js:42:11
     year: "numeric",
     month: "2-digit",
     day: "2-digit",
-    hour: "numeric",
+    hour: "",
     minute: "2-digit",
     hour12: true,
killedBy: dateUtils tests formatDateTime tests formats ISO date-time without seconds or timezone
statusReason: Value  out of range for Intl.DateTimeFormat options property hour

[Killed] StringLiteral
src/main/utils/dateUtils.js:43:13
     month: "2-digit",
     day: "2-digit",
     hour: "numeric",
-    minute: "2-digit",
+    minute: "",
     hour12: true,
   }).format(date);
killedBy: dateUtils tests formatDateTime tests formats ISO date-time without seconds or timezone
statusReason: Value  out of range for Intl.DateTimeFormat options property minute

[Killed] BooleanLiteral
src/main/utils/dateUtils.js:44:13
     day: "2-digit",
     hour: "numeric",
     minute: "2-digit",
-    hour12: true,
+    hour12: false,
   }).format(date);
 }
killedBy: dateUtils tests formatDateTime tests formats ISO date-time without seconds or timezone
statusReason: expected '12/12/2024, 00:00' to match /12\/12\/2024, 12:00 AM/12\

[Killed] StringLiteral
src/main/utils/dateUtils.js:58:12
   const secondsPast = Math.floor((now - dateFromEpoch) / 1000);
 
   if (secondsPast < minutesInSeconds * 2) {
-    return "Online now";
+    return "";
   }
 
killedBy: dateUtils tests formatTime tests should return `Online now` for less than 2 minutes
statusReason: expected '' to deeply equal 'Online now'

[Killed] ConditionalExpression
src/main/utils/dateUtils.js:68:28
 
   if (secondsPast < dayInSeconds) {
     const hours = Math.floor(secondsPast / 3600);
-    return `${hours} hour${hours > 1 ? "s" : ""} ago`;
+    return `${hours} hour${false ? "s" : ""} ago`;
   }
 
killedBy: dateUtils tests formatTime tests should return hours ago format
statusReason: expected '3 hour ago' to deeply equal '3 hours ago'
