[Killed] ArrowFunction
main/components/Announcement/AnnouncementForm.jsx:17:5
 }) {
   // Convert ISO dates to datetime-local format for form input
   const convertedInitialContents = useMemo(
-    () =>
-      initialContents
-        ? {
-            ...initialContents,
-            startDate: isoDateTimeToDatetimeLocal(initialContents.startDate),
-            endDate: initialContents.endDate
-              ? isoDateTimeToDatetimeLocal(initialContents.endDate)
-              : undefined,
-          }
-        : {},
+    () => undefined,
     [initialContents],
   );
killedBy: AdminEditAnnouncementsPage tests form is pre-populated with announcement data
statusReason: expect(element).toHaveValue(2024-12-12T00:00)

Expected the element to have value:
  2024-12-12T00:00
Received:


Ignored nodes: comments, script, style

[Killed] ObjectLiteral
main/components/Announcement/AnnouncementForm.jsx:19:11
   const convertedInitialContents = useMemo(
     () =>
       initialContents
-        ? {
-            ...initialContents,
-            startDate: isoDateTimeToDatetimeLocal(initialContents.startDate),
-            endDate: initialContents.endDate
-              ? isoDateTimeToDatetimeLocal(initialContents.endDate)
-              : undefined,
-          }
+        ? {}
         : {},
     [initialContents],
killedBy: AdminEditAnnouncementsPage tests form is pre-populated with announcement data
statusReason: expect(element).toHaveValue(2024-12-12T00:00)

Expected the element to have value:
  2024-12-12T00:00
Received:


Ignored nodes: comments, script, style

[Killed] BlockStatement
main/components/Announcement/AnnouncementForm.jsx:41:19
   // Stryker restore all
 
   // Update form values when initial data arrives
-  useEffect(() => {
-    if (initialContents) {
-      reset(convertedInitialContents);
-    }
-  }, [initialContents, reset, convertedInitialContents]);
+  useEffect(() => {}, [initialContents, reset, convertedInitialContents]);
 
   const navigate = useNavigate();
killedBy: AdminEditAnnouncementsPage tests form is pre-populated with announcement data
statusReason: expect(element).toHaveValue(2024-12-12T00:00)

Expected the element to have value:
  2024-12-12T00:00
Received:


Ignored nodes: comments, script, style

[Killed] BlockStatement
main/components/Announcement/AnnouncementForm.jsx:42:26
 
   // Update form values when initial data arrives
   useEffect(() => {
-    if (initialContents) {
-      reset(convertedInitialContents);
-    }
+    if (initialContents) {}
   }, [initialContents, reset, convertedInitialContents]);
 
killedBy: AdminEditAnnouncementsPage tests form is pre-populated with announcement data
statusReason: expect(element).toHaveValue(2024-12-12T00:00)

Expected the element to have value:
  2024-12-12T00:00
Received:


Ignored nodes: comments, script, style

[Killed] ConditionalExpression
main/components/Announcement/AnnouncementForm.jsx:42:9
 
   // Update form values when initial data arrives
   useEffect(() => {
-    if (initialContents) {
+    if (false) {
       reset(convertedInitialContents);
     }
killedBy: AdminEditAnnouncementsPage tests form is pre-populated with announcement data
statusReason: expect(element).toHaveValue(2024-12-12T00:00)

Expected the element to have value:
  2024-12-12T00:00
Received:


Ignored nodes: comments, script, style

[Killed] StringLiteral
main/components/Announcement/AnnouncementForm.jsx:50:27
   const navigate = useNavigate();
 
   const testIdPrefix = "AnnouncementForm";
-  const startDate = watch("startDate");
+  const startDate = watch("");
   const announcementText = watch("announcementText");
   const announcementTextMaxLengthMessage = `Announcement must be ${ANNOUNCEMENT_TEXT_MAX_LENGTH} characters or fewer.`;
killedBy: AnnouncementForm tests that end date equal to start date is invalid
statusReason: Unable to find an element with the text: /End Date must be after Start Date./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/Announcement/AnnouncementForm.jsx:51:34
 
   const testIdPrefix = "AnnouncementForm";
   const startDate = watch("startDate");
-  const announcementText = watch("announcementText");
+  const announcementText = watch("");
   const announcementTextMaxLengthMessage = `Announcement must be ${ANNOUNCEMENT_TEXT_MAX_LENGTH} characters or fewer.`;
   const atMaxAnnouncementLength =
killedBy: AnnouncementForm tests shows max length error when announcement reaches character limit
statusReason: Unable to find an element with the text: Announcement must be 255 characters or fewer.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] EqualityOperator
main/components/Announcement/AnnouncementForm.jsx:54:5
   const announcementText = watch("announcementText");
   const announcementTextMaxLengthMessage = `Announcement must be ${ANNOUNCEMENT_TEXT_MAX_LENGTH} characters or fewer.`;
   const atMaxAnnouncementLength =
-    (announcementText?.length ?? 0) >= ANNOUNCEMENT_TEXT_MAX_LENGTH;
+    (announcementText?.length ?? 0) > ANNOUNCEMENT_TEXT_MAX_LENGTH;
   const announcementTextInvalid =
     Boolean(errors.announcementText) || atMaxAnnouncementLength;
killedBy: AnnouncementForm tests shows max length error when announcement reaches character limit
statusReason: Unable to find an element with the text: Announcement must be 255 characters or fewer.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/Announcement/AnnouncementForm.jsx:54:5
   const announcementText = watch("announcementText");
   const announcementTextMaxLengthMessage = `Announcement must be ${ANNOUNCEMENT_TEXT_MAX_LENGTH} characters or fewer.`;
   const atMaxAnnouncementLength =
-    (announcementText?.length ?? 0) >= ANNOUNCEMENT_TEXT_MAX_LENGTH;
+    true;
   const announcementTextInvalid =
     Boolean(errors.announcementText) || atMaxAnnouncementLength;
killedBy: AnnouncementForm tests short announcement text is not marked invalid
statusReason: expect(element).not.toHaveClass("is-invalid")

Expected the element not to have class:
  is-invalid
Received:
  form-control is-invalid

[Killed] ConditionalExpression
main/components/Announcement/AnnouncementForm.jsx:56:5
   const atMaxAnnouncementLength =
     (announcementText?.length ?? 0) >= ANNOUNCEMENT_TEXT_MAX_LENGTH;
   const announcementTextInvalid =
-    Boolean(errors.announcementText) || atMaxAnnouncementLength;
+    true;
 
   // For explanation, see: https://stackoverflow.com/questions/3143070/javascript-regex-iso-datetime
killedBy: AnnouncementForm tests short announcement text is not marked invalid
statusReason: expect(element).not.toHaveClass("is-invalid")

Expected the element not to have class:
  is-invalid
Received:
  form-control is-invalid

[Killed] LogicalOperator
main/components/Announcement/AnnouncementForm.jsx:56:5
   const atMaxAnnouncementLength =
     (announcementText?.length ?? 0) >= ANNOUNCEMENT_TEXT_MAX_LENGTH;
   const announcementTextInvalid =
-    Boolean(errors.announcementText) || atMaxAnnouncementLength;
+    Boolean(errors.announcementText) && atMaxAnnouncementLength;
 
   // For explanation, see: https://stackoverflow.com/questions/3143070/javascript-regex-iso-datetime
killedBy: AnnouncementForm tests shows max length error when announcement reaches character limit
statusReason: expect(element).toHaveClass("is-invalid")

Expected the element to have class:
  is-invalid
Received:
  form-control

[Killed] ConditionalExpression
main/components/Announcement/AnnouncementForm.jsx:70:8
 
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
-      {initialContents && (
-        <Form.Group className="mb-3">
-          <Form.Label htmlFor="id">Id</Form.Label>
-          <Form.Control
-            // Stryker disable next-line all
-            data-testid={testIdPrefix + "-id"}
-            id="id"
-            type="text"
-            {...register("id")}
-            value={initialContents.id}
-            disabled
-          />
-        </Form.Group>
-      )}
+      {true}
 
       <Form.Group className="mb-3">
killedBy: AnnouncementForm tests renders correctly when passing in initialContents
statusReason: Unable to find an element by: [data-testid="AnnouncementForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/Announcement/AnnouncementForm.jsx:70:8
 
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
-      {initialContents && (
-        <Form.Group className="mb-3">
-          <Form.Label htmlFor="id">Id</Form.Label>
-          <Form.Control
-            // Stryker disable next-line all
-            data-testid={testIdPrefix + "-id"}
-            id="id"
-            type="text"
-            {...register("id")}
-            value={initialContents.id}
-            disabled
-          />
-        </Form.Group>
-      )}
+      {initialContents || <Form.Group className="mb-3">
+          <Form.Label htmlFor="id">Id</Form.Label>
+          <Form.Control
+  // Stryker disable next-line all
+  data-testid={testIdPrefix + "-id"} id="id" type="text" {...register("id")} value={initialContents.id} disabled />
+        </Form.Group>}
 
       <Form.Group className="mb-3">
killedBy: AnnouncementForm tests renders correctly with no initialContents
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
main/components/Announcement/AnnouncementForm.jsx:99:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.startDate &&
-            "Start Date is required and must be provided in ISO format."}
+          {false}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: AnnouncementForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Start Date is required and must be provided in ISO format./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/Announcement/AnnouncementForm.jsx:99:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.startDate &&
-            "Start Date is required and must be provided in ISO format."}
+          {errors.startDate || "Start Date is required and must be provided in ISO format."}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: AnnouncementForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Announcement is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] ArrowFunction
main/components/Announcement/AnnouncementForm.jsx:115:23
           // Stryker disable next-line all
           {...register("endDate", {
             pattern: isodate_regex,
-            validate: (value) =>
-              !value ||
-              !startDate ||
-              value > startDate ||
-              "End Date must be after Start Date.",
+            validate: () => undefined,
           })}
         />
killedBy: AnnouncementForm tests that end date equal to start date is invalid
statusReason: Unable to find an element with the text: /End Date must be after Start Date./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] BooleanLiteral
main/components/Announcement/AnnouncementForm.jsx:116:15
           {...register("endDate", {
             pattern: isodate_regex,
             validate: (value) =>
-              !value ||
+              value ||
               !startDate ||
               value > startDate ||
killedBy: AnnouncementForm tests calls submitAction when form is valid
statusReason: expected "spy" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <form

[Killed] LogicalOperator
main/components/Announcement/AnnouncementForm.jsx:116:15
           {...register("endDate", {
             pattern: isodate_regex,
             validate: (value) =>
-              !value ||
-              !startDate ||
-              value > startDate ||
+              (!value || !startDate) && value > startDate ||
               "End Date must be after Start Date.",
           })}
killedBy: AnnouncementForm tests calls submitAction when form is valid
statusReason: expected "spy" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <form

[Killed] BooleanLiteral
main/components/Announcement/AnnouncementForm.jsx:117:15
             pattern: isodate_regex,
             validate: (value) =>
               !value ||
-              !startDate ||
+              startDate ||
               value > startDate ||
               "End Date must be after Start Date.",
killedBy: AnnouncementForm tests calls submitAction with end date when provided
statusReason: expected "spy" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <form

[Killed] EqualityOperator
main/components/Announcement/AnnouncementForm.jsx:118:15
             validate: (value) =>
               !value ||
               !startDate ||
-              value > startDate ||
+              value <= startDate ||
               "End Date must be after Start Date.",
           })}
killedBy: AnnouncementForm tests calls submitAction with end date when provided
statusReason: expected "spy" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <form

[Killed] EqualityOperator
main/components/Announcement/AnnouncementForm.jsx:118:15
             validate: (value) =>
               !value ||
               !startDate ||
-              value > startDate ||
+              value >= startDate ||
               "End Date must be after Start Date.",
           })}
killedBy: AnnouncementForm tests that end date equal to start date is invalid
statusReason: Unable to find an element with the text: /End Date must be after Start Date./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] OptionalChaining
main/components/Announcement/AnnouncementForm.jsx:123:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.endDate?.message}
+          {errors.endDate.message}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: AnnouncementForm tests renders correctly with no initialContents
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] ObjectLiteral
main/components/Announcement/AnnouncementForm.jsx:137:44
           rows={5}
           maxLength={ANNOUNCEMENT_TEXT_MAX_LENGTH}
           isInvalid={announcementTextInvalid}
-          {...register("announcementText", {
-            required: "Announcement is required.",
-            maxLength: {
-              value: ANNOUNCEMENT_TEXT_MAX_LENGTH,
-              message: announcementTextMaxLengthMessage,
-            },
-          })}
+          {...register("announcementText", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: AnnouncementForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Announcement is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/Announcement/AnnouncementForm.jsx:146:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.announcementText?.message ||
-            (atMaxAnnouncementLength && announcementTextMaxLengthMessage)}
+          {errors.announcementText?.message && atMaxAnnouncementLength && announcementTextMaxLengthMessage}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: AnnouncementForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Announcement is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/Announcement/AnnouncementForm.jsx:146:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.announcementText?.message ||
-            (atMaxAnnouncementLength && announcementTextMaxLengthMessage)}
+          {true}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: AnnouncementForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Announcement is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/Announcement/AnnouncementForm.jsx:147:14
         />
         <Form.Control.Feedback type="invalid">
           {errors.announcementText?.message ||
-            (atMaxAnnouncementLength && announcementTextMaxLengthMessage)}
+            (atMaxAnnouncementLength || announcementTextMaxLengthMessage)}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: AnnouncementForm tests short announcement text is not marked invalid
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="invalid-feedback"
>
  Announcement must be 255 characters or fewer.
</div> instead

[Killed] ConditionalExpression
main/components/Announcement/AnnouncementForm.jsx:147:14
         />
         <Form.Control.Feedback type="invalid">
           {errors.announcementText?.message ||
-            (atMaxAnnouncementLength && announcementTextMaxLengthMessage)}
+            (false)}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: AnnouncementForm tests shows max length error when announcement reaches character limit
statusReason: Unable to find an element with the text: Announcement must be 255 characters or fewer.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
