[Killed] OptionalChaining
src/main/pages/AdminEditAnnouncementsPage.jsx:36:23
   );
   // Stryker restore all
 
-  const commonsName = commonsPlus?.commons.name;
+  const commonsName = commonsPlus.commons.name;
 
   const objectToAxiosParams = (editedAnnouncement) => {
killedBy: AdminEditAnnouncementsPage tests renders page without crashing
statusReason: Cannot read properties of undefined (reading 'commons')

[Killed] BlockStatement
src/main/pages/AdminEditAnnouncementsPage.jsx:38:55
 
   const commonsName = commonsPlus?.commons.name;
 
-  const objectToAxiosParams = (editedAnnouncement) => {
-    const idToUse = editedAnnouncement?.id ?? announcementId;
-    const params = {
-      id: idToUse,
-      commonsId,
-      startDate: datetimeLocalToIsoDateTime(editedAnnouncement.startDate),
-      announcementText: editedAnnouncement.announcementText,
-    };
-    if (editedAnnouncement.endDate) {
-      params.endDate = datetimeLocalToIsoDateTime(editedAnnouncement.endDate);
-    }
-    return {
-      url: "/api/announcements/put",
-      method: "PUT",
-      params,
-    };
-  };
+  const objectToAxiosParams = (editedAnnouncement) => {};
 
   const onSuccess = (editedAnnouncement) => {
killedBy: AdminEditAnnouncementsPage tests update mutation is configured with correct API request and invalidate key
statusReason: expected undefined to deeply equal { url: '/api/announcements/put', …(2) }

[Survived] OptionalChaining
src/main/pages/AdminEditAnnouncementsPage.jsx:39:21
   const commonsName = commonsPlus?.commons.name;
 
   const objectToAxiosParams = (editedAnnouncement) => {
-    const idToUse = editedAnnouncement?.id ?? announcementId;
+    const idToUse = editedAnnouncement.id ?? announcementId;
     const params = {
       id: idToUse,

[Survived] LogicalOperator
src/main/pages/AdminEditAnnouncementsPage.jsx:39:21
   const commonsName = commonsPlus?.commons.name;
 
   const objectToAxiosParams = (editedAnnouncement) => {
-    const idToUse = editedAnnouncement?.id ?? announcementId;
+    const idToUse = editedAnnouncement?.id && announcementId;
     const params = {
       id: idToUse,

[Killed] ConditionalExpression
src/main/pages/AdminEditAnnouncementsPage.jsx:46:9
       startDate: datetimeLocalToIsoDateTime(editedAnnouncement.startDate),
       announcementText: editedAnnouncement.announcementText,
     };
-    if (editedAnnouncement.endDate) {
+    if (false) {
       params.endDate = datetimeLocalToIsoDateTime(editedAnnouncement.endDate);
     }
killedBy: AdminEditAnnouncementsPage tests update mutation is configured with correct API request and invalidate key
statusReason: expected { url: '/api/announcements/put', …(2) } to deeply equal { url: '/api/announcements/put', …(2) }

[Killed] BlockStatement
src/main/pages/AdminEditAnnouncementsPage.jsx:46:37
       startDate: datetimeLocalToIsoDateTime(editedAnnouncement.startDate),
       announcementText: editedAnnouncement.announcementText,
     };
-    if (editedAnnouncement.endDate) {
-      params.endDate = datetimeLocalToIsoDateTime(editedAnnouncement.endDate);
-    }
+    if (editedAnnouncement.endDate) {}
     return {
       url: "/api/announcements/put",
killedBy: AdminEditAnnouncementsPage tests update mutation is configured with correct API request and invalidate key
statusReason: expected { url: '/api/announcements/put', …(2) } to deeply equal { url: '/api/announcements/put', …(2) }

[Killed] ObjectLiteral
src/main/pages/AdminEditAnnouncementsPage.jsx:49:12
     if (editedAnnouncement.endDate) {
       params.endDate = datetimeLocalToIsoDateTime(editedAnnouncement.endDate);
     }
-    return {
-      url: "/api/announcements/put",
-      method: "PUT",
-      params,
-    };
+    return {};
   };
 
killedBy: AdminEditAnnouncementsPage tests update mutation is configured with correct API request and invalidate key
statusReason: expected {} to deeply equal { url: '/api/announcements/put', …(2) }

[Killed] BlockStatement
src/main/pages/AdminEditAnnouncementsPage.jsx:56:45
     };
   };
 
-  const onSuccess = (editedAnnouncement) => {
-    toast(
-      <div>
-        Announcement successfully edited!
-        <br />
-        {`commonsId: ${editedAnnouncement.id}`}
-        <br />
-        {`startDate: ${editedAnnouncement.startDate}`}
-        <br />
-        {`endDate: ${editedAnnouncement.endDate}`}
-        <br />
-        {`announcementText: ${editedAnnouncement.announcementText}`}
-      </div>,
-    );
-  };
+  const onSuccess = (editedAnnouncement) => {};
 
   // Stryker disable all
killedBy: AdminEditAnnouncementsPage tests onSuccess shows toast with announcement details
statusReason: expected "spy" to be called with arguments: [ { …(9) } ]

Number of calls: 0

[Killed] BlockStatement
src/main/pages/AdminEditAnnouncementsPage.jsx:81:40
   );
   // Stryker restore all
 
-  const submitAction = async (data) => {
-    mutation.mutate(data);
-  };
+  const submitAction = async (data) => {};
 
   if (mutation.isSuccess) {
killedBy: AdminEditAnnouncementsPage tests When you fill in form and click submit, the right things happen
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
src/main/pages/AdminEditAnnouncementsPage.jsx:86:26
   };
 
   if (mutation.isSuccess) {
-    return <Navigate to={`/admin/announcements/${commonsId}`} />;
+    return <Navigate to={``} />;
   }
 
killedBy: AdminEditAnnouncementsPage tests When you fill in form and click submit, the right things happen
statusReason: expected "spy" to be called with arguments: [ { to: '/admin/announcements/1' } ]

Received: 

  1st spy call:

  [
    {
