[Killed] BlockStatement
src/main/utils/announcementUtils.js:6:51
 export const ANNOUNCEMENT_TEXT_MAX_LENGTH = 255;
 
 // datetime-local inputs use "YYYY-MM-DDTHH:mm"; Spring ISO.DATE_TIME expects seconds.
-export function datetimeLocalToIsoDateTime(value) {
-  if (
-    typeof value === "string" &&
-    /^\d{4}-\d{2}-\d{2}T\d{2}:\d{2}$/.test(value)
-  ) {
-    return `${value}:00`;
-  }
-  return value;
-}
+export function datetimeLocalToIsoDateTime(value) {}
 
 // Convert ISO datetime to datetime-local format (YYYY-MM-DDTHH:mm)
killedBy: AdminEditAnnouncementsPage tests update mutation is configured with correct API request and invalidate key
statusReason: expected { url: '/api/announcements/put', …(2) } to deeply equal { url: '/api/announcements/put', …(2) }

[Killed] LogicalOperator
src/main/utils/announcementUtils.js:8:5
 // datetime-local inputs use "YYYY-MM-DDTHH:mm"; Spring ISO.DATE_TIME expects seconds.
 export function datetimeLocalToIsoDateTime(value) {
   if (
-    typeof value === "string" &&
-    /^\d{4}-\d{2}-\d{2}T\d{2}:\d{2}$/.test(value)
+    typeof value === "string" || /^\d{4}-\d{2}-\d{2}T\d{2}:\d{2}$/.test(value)
   ) {
     return `${value}:00`;
killedBy: AdminCreateAnnouncementsPage tests create mutation omits endDate when not provided
statusReason: expected { Object (url, method, ...) } to deeply equal { Object (url, method, ...) }

[Killed] ConditionalExpression
src/main/utils/announcementUtils.js:8:5
 // datetime-local inputs use "YYYY-MM-DDTHH:mm"; Spring ISO.DATE_TIME expects seconds.
 export function datetimeLocalToIsoDateTime(value) {
   if (
-    typeof value === "string" &&
-    /^\d{4}-\d{2}-\d{2}T\d{2}:\d{2}$/.test(value)
+    false
   ) {
     return `${value}:00`;
killedBy: AdminEditAnnouncementsPage tests update mutation is configured with correct API request and invalidate key
statusReason: expected { url: '/api/announcements/put', …(2) } to deeply equal { url: '/api/announcements/put', …(2) }

[Killed] BlockStatement
src/main/utils/announcementUtils.js:10:5
   if (
     typeof value === "string" &&
     /^\d{4}-\d{2}-\d{2}T\d{2}:\d{2}$/.test(value)
-  ) {
-    return `${value}:00`;
-  }
+  ) {}
   return value;
 }
killedBy: AdminEditAnnouncementsPage tests update mutation is configured with correct API request and invalidate key
statusReason: expected { url: '/api/announcements/put', …(2) } to deeply equal { url: '/api/announcements/put', …(2) }

[Killed] BlockStatement
src/main/utils/announcementUtils.js:17:51
 }
 
 // Convert ISO datetime to datetime-local format (YYYY-MM-DDTHH:mm)
-export function isoDateTimeToDatetimeLocal(value) {
-  if (typeof value === "string") {
-    // Handle ISO format: "YYYY-MM-DDTHH:mm:ss" or "YYYY-MM-DDTHH:mm:ss.SSS"
-    const match = value.match(/^(\d{4}-\d{2}-\d{2}T\d{2}:\d{2})/);
-    if (match) {
-      return match[1];
-    }
-  }
-  return value;
-}
+export function isoDateTimeToDatetimeLocal(value) {}
 
 export function onDeleteSuccess(message) {
killedBy: AdminEditAnnouncementsPage tests form is pre-populated with announcement data
statusReason: expect(element).toHaveValue(2024-12-12T00:00)

Expected the element to have value:
  2024-12-12T00:00
Received:


Ignored nodes: comments, script, style

[Killed] ConditionalExpression
src/main/utils/announcementUtils.js:18:7
 
 // Convert ISO datetime to datetime-local format (YYYY-MM-DDTHH:mm)
 export function isoDateTimeToDatetimeLocal(value) {
-  if (typeof value === "string") {
+  if (true) {
     // Handle ISO format: "YYYY-MM-DDTHH:mm:ss" or "YYYY-MM-DDTHH:mm:ss.SSS"
     const match = value.match(/^(\d{4}-\d{2}-\d{2}T\d{2}:\d{2})/);
killedBy: AnnouncementUtils isoDateTimeToDatetimeLocal returns non-string values unchanged
statusReason: Cannot read properties of null (reading 'match')

[Killed] ConditionalExpression
src/main/utils/announcementUtils.js:18:7
 
 // Convert ISO datetime to datetime-local format (YYYY-MM-DDTHH:mm)
 export function isoDateTimeToDatetimeLocal(value) {
-  if (typeof value === "string") {
+  if (false) {
     // Handle ISO format: "YYYY-MM-DDTHH:mm:ss" or "YYYY-MM-DDTHH:mm:ss.SSS"
     const match = value.match(/^(\d{4}-\d{2}-\d{2}T\d{2}:\d{2})/);
killedBy: AnnouncementUtils isoDateTimeToDatetimeLocal converts ISO datetime with seconds to datetime-local format
statusReason: expected '2024-12-12T00:00:00' to be '2024-12-12T00:00' // Object.is equality

[Killed] ConditionalExpression
src/main/utils/announcementUtils.js:21:9
   if (typeof value === "string") {
     // Handle ISO format: "YYYY-MM-DDTHH:mm:ss" or "YYYY-MM-DDTHH:mm:ss.SSS"
     const match = value.match(/^(\d{4}-\d{2}-\d{2}T\d{2}:\d{2})/);
-    if (match) {
+    if (true) {
       return match[1];
     }
killedBy: AnnouncementUtils isoDateTimeToDatetimeLocal returns non-string values unchanged
statusReason: Cannot read properties of null (reading '1')

[Killed] BlockStatement
src/main/utils/announcementUtils.js:21:16
   if (typeof value === "string") {
     // Handle ISO format: "YYYY-MM-DDTHH:mm:ss" or "YYYY-MM-DDTHH:mm:ss.SSS"
     const match = value.match(/^(\d{4}-\d{2}-\d{2}T\d{2}:\d{2})/);
-    if (match) {
-      return match[1];
-    }
+    if (match) {}
   }
   return value;
killedBy: AnnouncementUtils isoDateTimeToDatetimeLocal converts ISO datetime with seconds to datetime-local format
statusReason: expected '2024-12-12T00:00:00' to be '2024-12-12T00:00' // Object.is equality

[Killed] BlockStatement
src/main/utils/announcementUtils.js:33:47
   toast(message);
 }
 
-export function cellToAxiosParamsDelete(cell) {
-  return {
-    url: "/api/announcements/delete",
-    method: "DELETE",
-    params: {
-      id: cell.row.values.id,
-    },
-  };
-}
+export function cellToAxiosParamsDelete(cell) {}
 
killedBy: AdminAnnouncementsPage tests admin can delete an announcement
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ObjectLiteral
src/main/utils/announcementUtils.js:34:10
 }
 
 export function cellToAxiosParamsDelete(cell) {
-  return {
-    url: "/api/announcements/delete",
-    method: "DELETE",
-    params: {
-      id: cell.row.values.id,
-    },
-  };
+  return {};
 }
 
killedBy: AdminAnnouncementsPage tests admin can delete an announcement
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
src/main/utils/announcementUtils.js:35:10
 
 export function cellToAxiosParamsDelete(cell) {
   return {
-    url: "/api/announcements/delete",
+    url: "",
     method: "DELETE",
     params: {
killedBy: AdminAnnouncementsPage tests admin can delete an announcement
statusReason: expected "spy" to be called with arguments: [ { id: 1, commonsId: 1, …(3) } ]

Received: 

  1st spy call:

  [
-   {
